{
  "id": "transcript_7770f096d876",
  "url": "https://www.youtube.com/watch?v=djDZHAi75dk",
  "title": "-  Video djDZHAi75dk",
  "transcript": "*Showing first 800 characters:*\n```\nLet's be honest, your AI generated websites look terrible. And I know exactly why. You're going into cursor or claude and just typing make it beautiful or make it look professional, then wondering why you end up with the same boring generic designs that look like every other AI built site out there. The problem isn't the AI, it's how you're using it. Today, I'm going to show you three proven methods and some game-changing tricks that will completely elevate your websites and make them look absolutely stunning. So, jumping right into it, the first method is to take a design that's already been made and clone it perfectly. Here's how it works. You need to extract a proper design profile from whatever you want to replicate. For example, I grabbed this random design. If I want to make a websit...\n```\n📊 **Full transcript:** 10,926 characters • 1,941 words\n---\n### 🎓 Tutorial Guide\nOVERVIEW\nLearn how to create professionally designed AI-generated websites using design systems and customization tools, moving beyond generic-looking outputs.\nPREREQUISITES\n- Access to AI tools (Claude, ChatGPT, or Cursor)\n- Basic understanding of HTML, CSS, and JavaScript\n- Access to Tweak CN website (for Method 2)\nSTEPS\nMethod 1: Cloning Existing Designs\n1. Find a design you want to replicate\n2. Ask AI (Claude/ChatGPT) to create a JSON design system from the reference design\n3. Save the generated JSON design system file\n4. Create your new project prompt without mentioning design specifics\n5. Include the JSON design system file in your prompt to the AI\n6. Ask AI to follow the design system while generating the code\nMethod 2: Creating Original Designs with Tweak CN\n1. Visit Tweak CN website\n2. Use the customization interface:\n   - Adjust primary colors\n   - Modify accent colors\n   - Customize base colors\n   - Set card colors\n3. Preview changes in real-time\n4. Export your customized design system\nTIPS & BEST PRACTICES\n- Don't just ask AI to \"make it beautiful\" or \"make it professional\"\n- Provide specific design systems or guidelines\n- Use JSON design systems for consistent styling\n- Test the design system with small components first\n- Make incremental adjustments to achieve desired results\nCOMMON ISSUES\n- Generic-looking outputs when using vague design instructions\n- Inconsistent styling across components\n- Solution: Use detailed design systems rather than general design requests\n- Solution: Provide specific reference designs or customization parameters\nNote: The transcript was cut off, so there might be additional methods or tips that weren't included in this guide.",
  "action_plan": "",
  "summary": "Extracted from https://www.youtube.com/watch?v=djDZHAi75dk",
  "duration": null,
  "saved_at": "2025-06-19T12:26:24.261249",
  "accessed_count": 0,
  "last_accessed": "2025-06-19T12:26:24.261249",
  "metadata": {}
}